[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:33:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReviewForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="MenuItemReviewForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:58:27
               type="text"
               isInvalid={Boolean(errors.itemId)}
               {...register("itemId", {
-                required: true,
+                required: false,
                 pattern: digits_regex,
               })}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:63:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "itemId is required. "}
+              {false}
               {errors.itemId?.type === "pattern" &&
                 "itemId must contain only digits, e.g. 5 for itemId 5"}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:63:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "itemId is required. "}
+              {true}
               {errors.itemId?.type === "pattern" &&
                 "itemId must contain only digits, e.g. 5 for itemId 5"}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:64:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "itemId is required. "}
-              {errors.itemId?.type === "pattern" &&
-                "itemId must contain only digits, e.g. 5 for itemId 5"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /itemId must contain only digits, e.g. 5 for itemId 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:64:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "itemId is required. "}
-              {errors.itemId?.type === "pattern" &&
+              {true &&
                 "itemId must contain only digits, e.g. 5 for itemId 5"}
             </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: TestingLibraryElementError: Found multiple elements with the text: /Id/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="id"

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:65:17
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "itemId is required. "}
               {errors.itemId?.type === "pattern" &&
-                "itemId must contain only digits, e.g. 5 for itemId 5"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /itemId must contain only digits, e.g. 5 for itemId 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:78:27
               type="text"
               isInvalid={Boolean(errors.reviewerEmail)}
               {...register("reviewerEmail", {
-                required: true,
+                required: false,
                 pattern: email_regex,
               })}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:83:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail && "Email is required. "}
+              {true}
               {errors.reviewerEmail?.type === "pattern" &&
                 "Email must be in the format: example@domain.xyz"}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:83:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail && "Email is required. "}
+              {false}
               {errors.reviewerEmail?.type === "pattern" &&
                 "Email must be in the format: example@domain.xyz"}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:84:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Email is required. "}
-              {errors.reviewerEmail?.type === "pattern" &&
-                "Email must be in the format: example@domain.xyz"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Email must be in the format: example@domain.xyz/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:84:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Email is required. "}
-              {errors.reviewerEmail?.type === "pattern" &&
+              {true &&
                 "Email must be in the format: example@domain.xyz"}
             </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Email must be in the format: example@domain.xyz</div> instead

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:100:37
               id="stars"
               type="text"
               isInvalid={Boolean(errors.stars)}
-              {...register("stars", {
-                required: true,
-                pattern: digits_regex,
-              })}
+              {...register("stars", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Star rating must be a digit 1-5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:106:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Star rating is required. "}
+              {true}
               {errors.stars?.type === "pattern" &&
                 "Star rating must be a digit 1-5"}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Star rating is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:106:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Star rating is required. "}
+              {errors.stars || "Star rating is required. "}
               {errors.stars?.type === "pattern" &&
                 "Star rating must be a digit 1-5"}
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:107:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Star rating is required. "}
-              {errors.stars?.type === "pattern" &&
+              {errors.stars.type === "pattern" &&
                 "Star rating must be a digit 1-5"}
             </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:107:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Star rating is required. "}
-              {errors.stars?.type === "pattern" &&
-                "Star rating must be a digit 1-5"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Star rating must be a digit 1-5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:108:17
             <Form.Control.Feedback type="invalid">
               {errors.stars && "Star rating is required. "}
               {errors.stars?.type === "pattern" &&
-                "Star rating must be a digit 1-5"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Star rating must be a digit 1-5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:142:27
               type="text"
               isInvalid={Boolean(errors.comments)}
               {...register("comments", {
-                required: true,
+                required: false,
               })}
             />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments for this review are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:146:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.comments && "Comments for this review are required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments for this review are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:146:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.comments && "Comments for this review are required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments for this review are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
