[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:40:17
     },
     {
       Header: "Item ID",
-      accessor: "itemId",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-itemId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:44:17
     },
     {
       Header: "Email",
-      accessor: "reviewerEmail",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-reviewerEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:65:56
       ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:65:30
       ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewTable"),
+      ButtonColumn("Delete", "", deleteCallback, "MenuItemReviewTable"),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:70:56
   }
 
   return (
-    <OurTable data={reviews} columns={columns} testid={"MenuItemReviewTable"} />
+    <OurTable data={reviews} columns={columns} testid={""} />
   );
 }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
