[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.js:28:55
     },
   );
 
-  const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
-    data: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
-  });
+  const objectToAxiosPutParams = (menuItemReview) => ({});
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "MenuItemReview Updated - id: 17 itemId: 23"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.js:43:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `MenuItemReview Updated - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`,
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/pages/MenuItemReview/MenuItemReviewEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuItemReview && (
-          <MenuItemReviewForm
-            initialContents={menuItemReview}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {menuItemReview || <MenuItemReviewForm initialContents={menuItemReview} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="MenuItemReviewForm-itemId" id="itemId" name="itemId" type="text" /> instead
