[Killed] ArrayDeclaration
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:34:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/menuitemreview/all"],
     { method: "GET", url: "/api/menuitemreview/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: MenuItemReviewIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="MenuItemReviewTable-cell-row-0-col-id" role="cell" /> instead
