[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:75:27
               type="text"
               isInvalid={Boolean(errors.teamId)}
               {...register("teamId", {
-                required: "The teamId is required",
+                required: "",
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /The teamId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:96:51
               id="tableOrBreakoutRoom"
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom", {
-                required: "The table or breakout room is required.",
-              })}
+              {...register("tableOrBreakoutRoom", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /The table or breakout room is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:122:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "The request time is required"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /The request time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:138:27
               type="text"
               isInvalid={Boolean(errors.explanation)}
               {...register("explanation", {
-                required: "The explanation is required",
+                required: "",
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /The explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
