[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.js:15:34
 export default function HelpRequestTable({ helpRequests, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/helpRequests/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/helpRequests/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:58:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Solved",
-      id: "solved",
-      Cell: ({ cell }) => cell.row.original.solved.toString(),
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:61:13
     {
       Header: "Solved",
       id: "solved",
-      Cell: ({ cell }) => cell.row.original.solved.toString(),
+      Cell: () => undefined,
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: /true/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
