[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:26:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={"RecommendationRequestForm-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid={"RecommendationRequestForm-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
       </Row>
       <Row>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:26:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={"RecommendationRequestForm-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
       <Row>
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Error: Unable to find an element by: [data-testid="/RecommendationRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
